nekobako/MIDI2KM/MIDI2KM/boards.txt
midi2km.name=MIDI2KM
midi2km.upload.tool=avrdude
midi2km.upload.protocol=avr109
midi2km.upload.maximum_size=28672
midi2km.upload.maximum_data_size=2560
midi2km.upload.speed=57600
midi2km.upload.disable_flushing=true
midi2km.upload.use_1200bps_touch=true
midi2km.upload.wait_for_upload_port=true

midi2km.build.mcu=atmega32u4
midi2km.build.f_cpu=8000000L
midi2km.build.vid=0x0507
midi2km.build.pid=0x0010
midi2km.build.usb_product="MIDI2KM"
midi2km.build.board=AVR_PROMICRO
midi2km.build.core=arduino_cdc_disabled
midi2km.build.variant=arduino:leonardo
midi2km.build.extra_flags={build.usb_flags}
